app/controllers/players_controller.rb

SELECT "players".* FROM "players"
---
  def index
    @players = Player.search(params[:q])

SELECT "teams".* FROM "teams" ORDER BY "teams"."name" ASC
---
  def new
    @player = Player.new
    @teams = Team.all.order(:name)

SELECT "teams".* FROM "teams" ORDER BY "teams"."name" ASC
---
  def edit
    @teams = Team.all.order(:name)

INSERT INTO "players" ("name", "surname", "born", "country", "position", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @player = Player.new(player_params)
    @teams = Team.all.order(:name)

    respond_to do |format|
      if @player.save

UPDATE "players" SET "team_id" = ?, "updated_at" = ? WHERE "players"."id" = ?  [["team_id", 1], ["updated_at", "2018-04-27 09:29:04.744795"], ["id", 1]]
---
  def update
    @teams = Team.all.order(:name)
    respond_to do |format|
      if @player.update(player_params)