app/controllers/teams_controller.rb

SELECT "teams".* FROM "teams"
---
  def index
    @teams = Team.search(params[:q])
      .order(sort_column + " " + sort_direction)
      .page(params[:page]).per(3)

INSERT INTO "teams" ("name", "city", "founded", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Du"], ["city", "Pa"], ["founded", "2018-08-27"], ["created_at", "2018-04-27 09:24:40.659933"], ["updated_at", "2018-04-27 09:24:40.659933"]]
---
  def create
    @team = Team.new(team_params)
    @leagues = League.all.order(:name)
    respond_to do |format|
      if @team.save

DELETE FROM "teams" WHERE "teams"."id" = ?  [["id", 1]]
---
  def destroy
    @team.destroy